html/rules_of_thumb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-18 Fri 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rules of thumb</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/"><h2>Ketan's Nebula</h2></a>
</div>
<div id="content" class="content">
<h1 class="title">rules of thumb
<br />
<span class="subtitle">Last modified on March 02, 2022</span>
</h1>

<div id="outline-container-ID-8e7296c1-ab28-4f94-a4da-70351fb9a4ff" class="outline-2">
<h2 id="ID-8e7296c1-ab28-4f94-a4da-70351fb9a4ff">structure is a constraint that leads to creativity.</h2>
<div class="outline-text-2" id="text-org720471a">
<p>
Like, <a href="structure.html#ID-dc6ecdde-e6b0-476d-8a4b-932de60062be">structure</a> prevents you from spending too much time in the "config layer." Spend more time in the execution layer, <a href="creativity.html#ID-7e73384c-4286-40e7-8d2a-e777d12c2bd1">creating</a>. But the perennial question is, "how much structure is too much structure?"<br />
</p>
</div>
</div>
<div id="outline-container-ID-748e3479-cb1f-4bf9-a780-2aad2978a90c" class="outline-2">
<h2 id="ID-748e3479-cb1f-4bf9-a780-2aad2978a90c">Keep It Simple Stupid (KISS)</h2>
<div class="outline-text-2" id="text-org14c5b37">
<p>
Related to the idea of constraints supporting creativity&#x2013;dead <a href="simplicity.html#ID-0dc3bc78-df96-4240-a6be-beb71e6074cc">simple</a> things, done <i>again and again</i> are extremely powerful.<br />
</p>
</div>
</div>
<div id="outline-container-ID-e18ffcb8-f4cf-4d42-a4d7-8e88f7264f4e" class="outline-2">
<h2 id="ID-e18ffcb8-f4cf-4d42-a4d7-8e88f7264f4e">Start simple and workable, and then unfold to something more complex.</h2>
<div class="outline-text-2" id="text-orgc80e03e">
<p>
By induction, if you can progress from complexity \(k\) to \(k + 1\), you can progress infinitely.<br />
</p>

<p>
Over time, I've gotten to know the amazing beast that is org mode. It is astounding how much you can do—but perhaps even more impressive is that you can start using it to do interesting things from the first day. You can learn in 5 minutes how to create headlines, expand and collapse nodes, write text, etc. That is not hard. In that way, it is a <a href="simplicity.html#ID-0dc3bc78-df96-4240-a6be-beb71e6074cc">simple</a> tool.<br />
</p>

<p>
This, I feel, should be part of my <a href="life_philosophy.html#ID-bc3b4ee4-b1b4-4b1c-a44b-c5785c5cafe5">life philosophy</a>. Wanna start a self-reflective practice? Make it extremely, dead, simple at first. Make it solid. Then, gradually, you can build from there. But you need that foundation to be laid down first, otherwise things are all like the kids who took caffeine or steroids&#x2026;stunted growth, or premature experience.<br />
</p>

<p>
Simple life philosophy. Simple running routine. Simple self-reflection routine. To start out with.<br />
</p>
</div>
</div>
<div id="outline-container-ID-50ffa84c-9659-4347-a03a-289ff063a738" class="outline-2">
<h2 id="ID-50ffa84c-9659-4347-a03a-289ff063a738">Simulate having a conversation with someone who knows their stuff.</h2>
<div class="outline-text-2" id="text-org44de471">
<p>
This works shockingly well when I'm having a problem, in that it sort of forces me to be rational about things and fully express all the particulars involved (which I may not have actually done in my in-head frustration.) Like imagine sitting with someone very level-headed.<br />
</p>
</div>
</div>
<div id="outline-container-ID-89a13330-d380-4e34-a177-3aad510bc516" class="outline-2">
<h2 id="ID-89a13330-d380-4e34-a177-3aad510bc516">Just go to bed.</h2>
<div class="outline-text-2" id="text-org2671d83">
<p>
<a href="sleep.html#ID-82af4da7-25b4-4584-ae1c-8110610d3cac">sleep</a> is really important. There's no use in staying up until 6am twiddling with some random thing that is bothering me in a project &#x2013; it'll probably just be counterproductive, because I'm replacing time that I could've spent rested and productive in the morning with time that I'm spending tired and unproductive at night.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with <span class="heart">♥</span> using
<a href="https://orgmode.org/">org-mode</a>.
Source code is available
<a href="https://github.com/ketan0/digital-laboratory">here</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
</div>
</body>
</html>
